In [1]:
import pandas as pd

In [3]:
# make a dataset with random numbers
data = {
    "name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah", "Ian", "Jack"],
    "age": [25, 30, 35, 40, 28, 33, 38, 29, 31, 27],
    "salary": [50000, 60000, 70000, 80000, 55000, 65000, 75000, 58000, 62000, 52000],
    "department": ["HR", "Finance", "IT", "Marketing", "HR", "Finance", "IT", "Marketing", "HR", "Finance"],
    "years_experience": [2, 5, 10, 7, 3, 6, 8, 4, 5, 2]
}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

      name  age  salary department  years_experience
0    Alice   25   50000         HR                 2
1      Bob   30   60000    Finance                 5
2  Charlie   35   70000         IT                10
3    David   40   80000  Marketing                 7
4      Eva   28   55000         HR                 3
5    Frank   33   65000    Finance                 6
6    Grace   38   75000         IT                 8
7   Hannah   29   58000  Marketing                 4
8      Ian   31   62000         HR                 5
9     Jack   27   52000    Finance                 2

In [10]:
df.info()
df.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   name              10 non-null     object
 1   age               10 non-null     int64
 2   salary            10 non-null     int64
 3   department        10 non-null     object
 4   years_experience  10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

    name  age  salary department  years_experience
0  Alice   25   50000         HR                 2
1    Bob   30   60000    Finance                 5

In [15]:
age_mean = df['age'].mean()
age_median = df['age'].median()
age_mode = df['age'].mode()[0]

In [16]:
print(f"The average age is: {age_mean}")
print(f"The median age is: {age_median}")
print(f"The mode age is: {age_mode}")

The average age is: 31.6
The median age is: 30.5
The mode age is: 25

In [17]:
# min, max, range, variance, standard deviation
age_min = df['age'].min()
age_max = df['age'].max()
age_range = age_max - age_min

In [18]:
print( f"The minimum age is: {age_min}")
print (f"the maximum age is : {age_max}")
print (f"The range of age is : {age_range}")

The minimum age is: 25
the maximum age is : 40
The range of age is : 15